/*

1번 while 은 조건이 맞을 시에만 실행하는거고 do while은 일단 실행을 하고 조건이 맞는다면 다시 실행하는 것이다.

2번 1 if (x < 10 || x > 20)
		printf("%d\n", x);
	2 if (x > 10 && x < 20)
		printf("%d\n", x);

3번 1 break가 없다
	2 else는 하나만 나와야하며 else 뒤에는 조건이 붙으면 안된다 2번을 맞게 수정하려면 3번째줄의 else를 if else로 바꾸고 5번째줄의 else 뒤의(n == 0)을 지워야한다.
	3 for 안에서 i = 1 / i <= 10 / i + 1사이에는, 가 아니라;이 들어와야한다.


	?? 앞은 추측 뒤는 실행한 결과 값
4번 1 ABCG?? ABCG가 나온다
	2 i = 7 j = 4 ?? i =8 j = 4
	3 1234568910 ?? 23456891011  n ++니까 연산이 먼저 되서 printf가 먼저 실행되고 나서 n에 1이 더해지는거 아닌가요?????
	4 16 ?? 16

5번 
	1 
	int i=1;
	while ( i <= 10)

		if (i % 5 == 0) {
			printf("%d\n", i);
		}
	i += 3;
	뭔가 잘못된거같은데 뭐가 틀렸는지 모르겠어요
	2
	int i;
	for(i=10;i<=0;i -=3){
	printf("%d\n",i);
	}
	2번도 뭔가 잘못된거같은데 뭐가틀렸는지 모르겠어요



	*/